// написать программу, в которой будет вводиться число, которое после возведется в квадрат

Console.Write("Введите число: ");
int value = Convert.ToInt32(Console.ReadLine());

Console.Write(value * value);